In [3]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd

data=[4, 8, 15, 16, 23, 42]

pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

import pandas as pd

list_10=[1,2,3,4,"pwskills","pandas",5.6,7.8,{0,9},True]

pd.Series(list_10)

0           1
1           2
2           3
3           4
4    pwskills
5      pandas
6         5.6
7         7.8
8      {0, 9}
9        True
dtype: object

In [9]:
#Q3. Create a Pandas DataFrame that contains the following data. Then, print the DataFrame.
#     Name       Age    Gender
#     Alice      25     Female
#     Bob        30     Male
#     Claire     27     Female

import pandas as pd

data={'Name':['Alice','Bob','Claire'] , 'Age':[25,30,27] , 'Gender':['Female','Male','Female']}

pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
"""
DataFrame is a two-dimensional tabular data structure,consists of rows and columns that can store data of different data types in columns,
much like a spreadsheet or SQL table.

Ex:
    Name	Age   Gender
0	Alice	25    Female
1	Bob  	30	  Male
2	Claire	27	  Female

Series is a one-dimensional array-like object that can store data of a single data type. It can be considered as a single column of a DataFrame.

Ex:
Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
"""

In [ ]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these 
#    functions?
"""
There are many functions available in Pandas to manipulate data in a DataFrame:
1. df.head(n): Returns the first n rows of the DataFrame. 
2. df.tail(n): Returns the last n rows of the DataFrame. 
3. df.colums(): Retuens the name of the columns
4. df.info(): Returns information about the DataFrame, including the number of rows and columns, the data types of the columns, and the amount 
              of memory used.
5. df.describe(): Generates descriptive statistics for the DataFrame, such as the mean, standard deviation, minimum, and maximum values
6. df.fillna(value): Fills missing values in the DataFrame with the specified value.
7. df.fillna(value): Fills missing values in the DataFrame with the specified value.
"""

In [ ]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
"""
Series, DataFrame and Panel all three are mutable in nature, meaning their values can be modified after they are created. 

However, Panel is no longer a recommended data structure in pandas and has been deprecated since version 0.25.0. Instead, pandas now recommends using
MultiIndex objects or simply using a dictionary of DataFrames when working with 3 or more dimensions.
"""

In [11]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

import pandas as pd

names = pd.Series(['Sai', 'Subham', 'Jena'])
ages = pd.Series([25, 30, 35,])
salaries = pd.Series([50000, 60000, 70000])

data={'Name':names,'Age':ages,'Salary':salaries}
pd.DataFrame(data)

     Name  Age  Salary
0     Sai   25   50000
1  Subham   30   60000
2    Jena   35   70000